Configuration/Documents/ОплатаПоСреднемуЗаработкуСписком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОплатаПоСреднемуЗаработкуСписком</Name>
			<Comment>АПК:58 Имя неверно образовано из синонима.</Comment>
			<BasedOn>
				<xr:Item>Document.ОбучениеСотрудниковОхранеТруда</xr:Item>
				<xr:Item>Document.ПроверкаЗнанияТребованийОхраныТруда</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 Имя неверно образовано из синонима.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутрисменноеОтсутствие</Name>
					<Comment>АПК:58 Имя неверно образовано из синонима.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтсутствия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплачиватьЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПоСреднемуЗаработку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Documents/ОплатаПоСреднемуЗаработкуСписком/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПериодПринадлежности = Дата;
	Документы.ОплатаПоСреднемуЗаработкуСписком.ЗаполнитьДатуЗапретаРедактирования(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСвязанныеОплатыПоСреднему(Отказ);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.ОбучениеПоОхранеТруда") Тогда
		МодульОбучениеПоОхранеТруда = ОбщегоНазначения.ОбщийМодуль("ОбучениеПоОхранеТруда");
		МодульОбучениеПоОхранеТруда.ПриЗаписиДокументаОтсутствия(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВнутрисменноеОтсутствие Тогда
		Для Каждого Строка Из Сотрудники Цикл
			ИндексСтроки = Сотрудники.Индекс(Строка);
			ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, Строка.ДатаОтсутствия, "Объект.Сотрудники.ДатаОтсутствия", Отказ,
				НСтр("ru='Дата отсутствия'"), , , Ложь);
			Если Не ЗначениеЗаполнено(Строка.ОплачиватьЧасов) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Не заполнены часы.'"),
					ЭтотОбъект, 
					СтрШаблон("ОплатаПоСреднемуЗаработкуСписком[%1].Сотрудники", Формат(ИндексСтроки, "ЧН=0; ЧГ=0")),, Отказ);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из Сотрудники Цикл
			ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, Строка.ДатаНачала, "Объект.Строка.ДатаНачала", Отказ, 
				НСтр("ru='Дата начала'"), , , Ложь);
		КонецЦикла;
	КонецЕсли;
	
	ЭДОБЗК.ПроверитьВозможностьСохраненияИзмененийДокументаСПечатнымиФормами(
		ЭтотОбъект, Метаданные.Роли.ДобавлениеИзменениеНачисленнойЗарплатыРасширенная, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСвязанныеОплатыПоСреднему(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаПоСреднемуЗаработкуСпискомСотрудники.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ОплатаПоСреднемуЗаработкуСписком.Сотрудники КАК ОплатаПоСреднемуЗаработкуСпискомСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаПоСреднемуЗаработку КАК ОплатаПоСреднемуДокументы
	|		ПО ОплатаПоСреднемуЗаработкуСпискомСотрудники.ОплатаПоСреднемуЗаработку = ОплатаПоСреднемуДокументы.Ссылка
	|			И (ОплатаПоСреднемуЗаработкуСпискомСотрудники.Сотрудник <> ОплатаПоСреднемуДокументы.Сотрудник
	|				ИЛИ ОплатаПоСреднемуЗаработкуСпискомСотрудники.ФизическоеЛицо <> ОплатаПоСреднемуДокументы.ФизическоеЛицо
	|				ИЛИ ОплатаПоСреднемуЗаработкуСпискомСотрудники.ДатаНачала <> ОплатаПоСреднемуДокументы.ДатаНачала
	|				ИЛИ ОплатаПоСреднемуЗаработкуСпискомСотрудники.ДатаОкончания <> ОплатаПоСреднемуДокументы.ДатаОкончания
	|				ИЛИ ОплатаПоСреднемуЗаработкуСпискомСотрудники.ДатаОтсутствия <> ОплатаПоСреднемуДокументы.ДатаОтсутствия
	|				ИЛИ ОплатаПоСреднемуЗаработкуСпискомСотрудники.ОплачиватьЧасов <> ОплатаПоСреднемуДокументы.ОплачиватьЧасов)
	|ГДЕ
	|	ОплатаПоСреднемуЗаработкуСпискомСотрудники.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбновитьСвязаннуюОплатуПоСреднему(Сотрудники[Выборка.НомерСтроки -1], Отказ);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСвязаннуюОплатуПоСреднему(Строка, Отказ)
	
	Если Не ЗначениеЗаполнено(Строка) 
		Или Не ЗначениеЗаполнено(Строка.ОплатаПоСреднемуЗаработку) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ДокументОбъект = Строка.ОплатаПоСреднемуЗаработку.ПолучитьОбъект();
		Если НЕ (ДокументОбъект.Проведен И ДокументОбъект.ДокументРассчитан) Тогда
			ДокументОбъект.Сотрудник = Строка.Сотрудник;
			ДокументОбъект.ФизическоеЛицо = Строка.ФизическоеЛицо;
			ДокументОбъект.ДатаНачала = Строка.ДатаНачала;
			ДокументОбъект.ДатаОкончания = Строка.ДатаОкончания;
			ДокументОбъект.ДатаОтсутствия = Строка.ДатаОтсутствия;
			ДокументОбъект.ОплачиватьЧасов = Строка.ОплачиватьЧасов;
			ДокументОбъект.ДатаОкончания = Строка.ДатаОкончания;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Иначе
			Отказ = Истина;
			НомерТекущейСтроки = Строка.НомерСтроки - 1;
			ТекстСообщения = НСтр("ru = 'Не удалось обновить отсутствие с сохранением оплаты %1, связанный документ рассчитан.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.ОплатаПоСреднемуЗаработку, НомерТекущейСтроки + 1);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.Сотрудники[" + НомерТекущейСтроки + "].ОплатаПоСреднемуЗаработку" , , Отказ);
		КонецЕсли;
		
	Исключение
		НомерТекущейСтроки = Строка.НомерСтроки - 1;
		ТекстСообщения = НСтр("ru = 'Не удалось обновить отсутствие с сохранением оплаты %1.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.Командировка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.Сотрудники[" + НомерТекущейСтроки + "].ОплатаПоСреднемуЗаработку" , , Отказ);
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
